Revit 2024 API
Document.NewRooms2 Method (Phase, Int32)
 Creates new unplaced rooms in the given phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ICollection<ElementId> NewRooms2(
	Phase phase,
	int count
)
Visual Basic
Public Function NewRooms2 ( _
	phase As Phase, _
	count As Integer _
) As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ NewRooms2(
	Phase^ phase,
	int count
)
Parameters
phase
Type: Autodesk.Revit.DB.Phase
 The phase on which the rooms are to exist.
count
Type: System.Int32
 The number of the rooms to be created.
Return Value
 If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | If the room can not be created successfully or regeneration fails at the end of the creation.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Document Class
NewRooms2 Overload
Autodesk.Revit.Creation Namespace